import 'dart:io';

import 'package:flutter/material.dart';

import '../../utils/app_colors.dart';

class Terms extends StatefulWidget {
  const Terms({Key? key}) : super(key: key);

  @override
  _TermsState createState() => _TermsState();
}

class _TermsState extends State<Terms> {
  String? nine;
  @override
  void initState() {
    nine = (Platform.isIOS)
        ? '''
9. ท่านสามารถยกเลิกบริการต่ออายุอัตโนมัติได้ด้วยวิธีต่อไปนี้
 โปรดไปที่ "ตั้งค่า ในมือถือ ต่อด้วย iTunes Store และ App Store -> เลือก Apple ID -> เลือก ดูApple ID -> ในหน้าบัญชีนั้นให้เลือก จัดการสมาชิก -> ยกเลิกการสมัครเป็นสมาชิก"
โดยอายุการเป็นสมาชิกจะสิ้นสุดตามวันที่และเวลาที่แสดงไว้ในระบบ
หมายเหตุพิเศษ: หลังจากยกเลิกบริการต่ออายุอัตโนมัติสำเร็จแล้ว จะไม่ส่งผลต่อสิทธิ์การเข้าใช้บริการที่ชำระค่าธรรมเนียมสำเร็จ และจะไม่ต่ออายุโดยอัตโนมัติหลังจากระยะเวลาที่มีผลใช้บังคับหมดลง ก่อนที่ท่านจะเลือกยุติบริการต่ออายุอัตโนมัติ ท่านยังคงใช้งานได้จนกว่าระยะเวลาของบริการต่ออายุอัตโนมัติเดิมสิ้นสุด ซึ่งบริษัท ฯจะไม่คืนเงินค่าธรรมเนียมที่หักตามคำสั่งซื้อเดิมที่ได้ชำระค่าบริการไปแล้ว
'''
        : '''
9. ท่านสามารถยกเลิกบริการต่ออายุอัตโนมัติได้ด้วยวิธีต่อไปนี้
 โปรดไปที่ "แอป Play Store และที่การชำระเงินและการสมัครใช้บริการ หรือกดที่เมนู การชำระเงินและการใช้บริการ เพื่อยกเลิกสถานะการเป็นสมาชิกและยกเลิกการต่ออายุอัตโนมัติในรอบต่อไป” โดยอายุการเป็นสมาชิกจะสิ้นสุดตามวันที่และเวลาที่แสดงไว้ในระบบ
หมายเหตุพิเศษ: หลังจากยกเลิกบริการต่ออายุอัตโนมัติสำเร็จแล้ว จะไม่ส่งผลต่อสิทธิ์การเข้าใช้บริการที่ชำระค่าธรรมเนียมสำเร็จ และจะไม่ต่ออายุโดยอัตโนมัติหลังจากระยะเวลาที่มีผลใช้บังคับหมดลง ก่อนที่ท่านจะเลือกยุติบริการต่ออายุอัตโนมัติ ท่านยังคงใช้งานได้จนกว่าระยะเวลาของบริการต่ออายุอัตโนมัติเดิมสิ้นสุด ซึ่งบริษัท ฯจะไม่คืนเงินค่าธรรมเนียมที่หักตามคำสั่งซื้อเดิมที่ได้ชำระค่าบริการไปแล้ว''';

    super.initState();
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        leading: IconButton(
            onPressed: () {
              Navigator.pop(context);
            },
            icon: Icon(Icons.arrow_back_ios),
            color: AppColor.title),
        elevation: 0,
        backgroundColor: AppColor.mainColor,
        title: Text(
          "ข้อตกลงและเงื่อนไขการใช้งาน",
          style: TextStyle(color: AppColor.title),
        ),
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text('''
ข้อตกลงและเงื่อนไขการใช้งาน

ข้อตกลงและเงื่อนไขการให้บริการและการเป็นสมาชิกบนแอปพลิเคชัน “วันเฮง” (เรียกสั้น ๆ ว่า "ข้อตกลงฉบับนี้") ที่บริษัท คอมพัฒนา จำกัด (เรียกว่า “บริษัทฯ”) ได้พัฒนาหรือจัดหา รวมถึงการเข้าถึงและใช้เนื้อหา คุณลักษณะ (Feature) เทคโนโลยี หรือ การทำงาน (Function) ที่ปรากฏในแอปพลิเคชัน และบริการต่าง ๆ ของบริษัทฯ ทั้งที่มีอยู่ในปัจจุบันและที่จะได้พัฒนาหรือจัดให้มีขึ้นในอนาคต  หากผู้ใช้งานได้ใช้และ/หรือเข้าถึง แอปพลิเคชันบนเครื่องมือหรืออุปกรณ์ใด ๆ ของท่านจะถือว่าท่านได้ตกลงยินยอมปฏิบัติตามข้อตกลงฉบับนี้

ข้อตกลงฉบับนี้เกี่ยวข้องกับสิทธิ์และผลประโยชน์ของท่าน (รวมถึงข้อกำหนดที่เกี่ยวข้องซึ่งยกเว้นเงื่อนไขความรับผิดชอบ เงื่อนไขการจำกัดสิทธิ์ของท่าน กระบวนการระงับข้อพิพาทที่ตกลงร่วมกัน และมาตราเขตอำนาจศาล ฯลฯ) กรุณาอ่านอย่างละเอียดรอบคอบและทำความเข้าใจข้อตกลงฉบับนี้อย่างถี่ถ้วนก่อนใช้บริการ

บริษัทฯ อาจดำเนินการแก้ไขหรือเปลี่ยนแปลง และ/หรือข้อตกลงนี้ตามการวางแผนโดยรวมของ “วันเฮง” หากท่านไม่ยอมรับการแก้ไขหรือเปลี่ยนแปลง “วันเฮง”  และ/หรือข้อตกลงนี้ตามข้างต้น ท่านสามารถยุติการใช้บริการ “วันเฮง” ได้ทุกเมื่อ การเข้าใช้บริการแอปพลิเคชัน “วันเฮง” ของท่าน ถือว่าท่านได้ยอมรับและตกลงตามเงื่อนไขทั้งหมดของข้อตกลงนี้ การแก้ไขและการเปลี่ยนแปลงดังกล่าวเป็นไปตามกฎหมายของประเทศที่ท่านพำนักอาศัย หากท่านยังไม่บรรลุนิติภาวะ โปรดพิจารณาทบทวนข้อตกลงนี้กับบิดามารดาหรือผู้ปกครองตามกฎหมายของท่าน

ข้อตกลงที่เกี่ยวข้องและกติกาของการใช้งานแอปพลิเคชัน “วันเฮง” ซึ่งเผยแพร่โดย บริษัทฯ ถือเป็นส่วนหนึ่งของข้อตกลงนี้เช่นกัน ในขณะที่ท่านใช้บริการแอปพลิเคชัน “วันเฮง” ท่านต้องปฏิบัติตามทุกข้อกำหนดในข้อตกลงฉบับนี้

หมายเหตุพิเศษ: หลังจากที่ท่านเปิดใช้บริการแอปพลิเคชัน “วันเฮง” ผ่านช่องทางที่กำหนดโดยบริษัทฯ แล้ว รายละเอียดบริการที่ท่านใช้งานจริงอาจแตกต่างไปตามเวอร์ชันของซอฟต์แวร์ อุปกรณ์ ระบบปฏิบัติการ ฯลฯ รวมถึงสาเหตุของบุคคลที่สาม ท่านเข้าใจถึงความไม่สะดวกที่อาจเกิดขึ้นกับท่าน และละทิ้งสิทธิ์ในการร้องเรียนค่าชดเชยต่อบริษัทฯ หรือกล่าวหาความรับผิดชอบต่อบริษัทฯ นอกจากนี้ข้อตกลงและเงื่อนไขการให้บริการและการเป็นสมาชิกแอปพลิเคชัน “วันเฮง”  อาจแตกต่างกันเนื่องจากเวอร์ชันของซอฟต์แวร์ต่าง ๆ ที่ท่านใช้ ท่านเข้าใจและยอมรับว่าเวอร์ชันที่ท่านใช้เป็นเวอร์ชันล่าสุดของข้อตกลงนี้

1. ข้อมูลทั่วไป
    1.1 บริการ “วันเฮง” เป็นแอปพลิเคชันที่สร้างและพัฒนาโดยบริษัท คอมพัฒนา ซึ่งสามารถติดตั้งผ่าน Google Play Store ในระบบปฏิบัติการแอนดรอยด์ และ App Store ในระบบปฎิบัติการ iOS 
    1.2 บริการ “วันเฮง” มีประเภทการให้บริการผู้ใช้ที่เป็นสมาชิกดังต่อไปนี้: 
	ไม่เสียค่าใช้จ่าย: การให้บริการมีข้อจำกัดคือ แอปพลิเคชันจำกัดการเข้าถึงข้อมูล 7 วันย้อนหลังและ 7 วันล่วงหน้า 
	บริการรายเดือน: สามารถเข้าถึงข้อมูลได้ทั้งหมดและต่ออายุสมาชิกทุก ๆ 30 วัน หากชำระช้าเกินกำหนด ท่านจะไม่สามารถเข้าใช้บริการได้

	บริการรายปี: สามารถเข้าถึงข้อมูลได้ทั้งหมดและต่ออายุสมาชิกทุก ๆ 365 วัน หากชำระช้าเกินกำหนด ท่านจะไม่สามารถเข้าใช้บริการได้

2. ขั้นตอนการรับบริการ
    2.1 วิธีการสมัครเป็นสมาชิก
      2.1.1 ท่านสามารถเลือกใช้วิธีการชำระเงินที่บริษัท ฯ กำหนด 2 ช่องทางได้แก่ การชำระค่าธรรมเนียมในแอปพลิเคชันของ Apple และการชำระค่าธรรมเนียมใน Google Play ซึ่งจะสามารถเปิดใช้บริการได้ภายหลังจากชำระค่าธรรมเนียมตามสัญญา ราคาค่าบริการอาจแตกต่างกันไปตามเวอร์ชันและประเภทการให้บริการรายเดือน หรือรายปีที่ท่านเลือกใช้ ทั้งนี้ขึ้นอยู่กับราคาที่ปรากฏขณะที่ท่านทำการเปิดใช้งาน 
    นอกจากนี้ ท่านไม่สามารถเปิดบริการสำหรับตัวท่านเองหรือผู้อื่นผ่านวิธีการใด ๆ ดังต่อไปนี้:
    (1) มีการใช้งานด้วยวัตถุประสงค์ที่ไม่ใช่ส่วนบุคคล เช่น เพื่อผลกำไร การดำเนินธุรกิจ เป็นต้น
    (2) ใช้โปรแกรมหรือซอฟต์แวร์อัตโนมัติใด ๆ เช่น ซอฟต์แวร์โรบอต ซอฟต์แวร์สไปเดอร์ ซอฟต์แวร์ครอว์เลอร์ และซอฟต์แวร์รีเฟรชชิง ฯลฯ
    (3) การเปิดใช้งานผ่านวิธีการที่ไม่เหมาะสมหรือวิธีการที่ละเมิดหลักสุจริต
    (4) ดำเนินการปรับเปลี่ยนระยะเวลาการให้บริการ ปริมาณการชำระเงิน สถานะทางธุรกรรม และข้อมูลอื่น ๆ ด้วยวิธีการทางเทคนิค
    (5) การเปิดใช้งานผ่านวิธีการที่นอกเหนือจากข้อกำหนดของบริษัท ฯ
    (6) การเปิดใช้งานผ่านการละเมิดสิทธิและผลประโยชน์ที่ถูกต้องตามกฎหมายของบริษัท ฯ หรือผู้อื่น
    (7) การเปิดใช้งานผ่านวิธีการอื่นที่เป็นการฝ่าฝืนกฎหมายและระเบียบข้อบังคับทางการปกครองที่เกี่ยวข้อง
    หากท่านละเมิดข้อกำหนดข้างต้น บริษัท ฯ ขอสงวนสิทธิ์ในการแก้ไข จำกัด ระงับหรือยุติการให้บริการทั้งหมด โดยไม่มีการชดเชยหรือคืนค่าธรรมเนียมใด ๆß
      2.1.2 ในช่วงที่ท่านได้เป็นสมาชิกตามวิธีที่กำหนด ท่านต้องอ่านพร้อมยืนยันข้อตกลงและการใช้งานที่เกี่ยวข้อง ข้อมูลที่ท่านให้ไว้เมื่อสมัครเข้าเป็นสมาชิก และข้อมูลดังกล่าวจะต้องเป็นจริงและถูกต้องสมบูรณ์ หากข้อมูลส่วนบุคคลมีการเปลี่ยนแปลง โปรดแก้ไขข้อมูลส่วนบุคคลของท่านโดยเร็วที่สุด
    2.2 หลังจากเปิดใช้บริการสำเร็จแล้ว ท่านสามารถเพลิดเพลินกับสิทธิพิเศษและบริการเสริมต่าง ๆ ได้ทันที วันที่มีผลบังคับใช้จะนับตั้งแต่วันที่เปิดใช้บริการ โดยท่านสามารถดูรายละเอียดวันหมดอายุสมาชิกได้ที่หน้า "ข้อมูลส่วนตัว - หมดอายุวันที่"
    2.3 ท่านสามารถต่ออายุได้โดยการซื้ออีกครั้งก่อนที่การให้บริการจะหมดอายุการใช้งานหรือเลือกต่ออายุอัตโนมัติ หากท่านไม่ได้ต่ออายุภายหลังจากที่สภาพสมาชิกหมดอายุ บริษัท ฯ จะยุติการให้บริการเข้าถึงข้อมูลของท่าน
    2.4 ท่านเข้าใจและยอมรับว่าบริการแอปพลิเคชันของบริษัท ฯ เป็นบริการเสมือนจริงบนพื้นฐานของอินเทอร์เน็ต ค่าสมัครสมาชิกและค่าต่ออายุสมาชิกเป็นราคาสินค้าผลิตภัณฑ์บนอินเทอร์เน็ตที่สอดคล้องกับประเภทการให้บริการที่ท่านเลือกซื้อ และไม่มีลักษณะของการชำระค่าธรรมเนียมล่วงหน้าหรือมัดจำ ฯลฯ เมื่อท่านเปิดใช้งานบริการแล้ว ท่านไม่สามารถโอนหรือขอคืนค่าธรรมเนียมได้ ยกเว้นกรณีที่ท่านยกเลิกการสมัครใช้บริการด้วยตนเอง ภายใต้ข้อกำหนดของ Google Play Store ในระบบแอนดรอยด์ หรือ App Store ในระบบ iOS หรือเนื่องจากข้อบกพร่องที่สำคัญในบริการของบริษัท ฯ เอง หรือในกรณีที่กฎหมายและข้อบังคับกำหนดให้ต้องคืนค่าธรรมเนียม หรือมีการตกลงคืนค่าธรรมเนียมหลังจากการตัดสินของฝ่ายกฎหมายเท่านั้น

3. ระเบียบการใช้งาน
    3.1 หลังจากที่ท่านเป็นสมาชิกแล้ว ท่านสามารถเพลิดเพลินกับการใช้บริการโดยอิงจากข้อมูลประเภทการให้บริการของท่านในหน้า "ข้อมูลส่วนตัว - Package"
    3.2 ไม่อนุญาตให้สมัครสมาชิกโดยการขาย การโอน การยักยอก หรือการเช่าบัญชีผู้ใช้อื่น ฯลฯ หรือไม่สามารถใช้บริการ โดยการขาย การโอน การยักยอก หรือการยืมบัญชีผู้ใช้อื่น หากตรวจพบการกระทำเหล่านี้บริษัท ฯ จะทำการระงับบัญชีผู้ใช้หรือยกเลิกการให้บริการ และจะไม่จ่ายค่าชดเชยหรือคืนค่าธรรมเนียม
    3.3 หากท่านละเมิดข้อตกลงนี้หรือข้อตกลงและเงื่อนไขอื่น ๆ บริษัท ฯ มีสิทธิ์ที่จะใช้มาตรการต่อไปนี้อย่างน้อยหนึ่งอย่าง:
      1). ใช้มาตรการทางเทคนิคเพื่อลบ บล็อก หรือตัดการเชื่อมต่อข้อมูลที่เกี่ยวข้อง
      2). แก้ไข จำกัด ระงับหรือยุติการให้บริการทั้งหมดหรือบางส่วน
      3). ท่านจะต้องชดใช้ค่าเสียหาย ซึ่งหากค่าเสียหายที่ชำระแล้วไม่เพียงพอต่อการชดเชยความสูญเสียที่แท้จริงของบริษัท ฯ ท่านจะต้องชดเชยความเสียหายที่เกิดขึ้นจริงเพิ่มเติมตามความเหมาะสม
    3.4 ท่านจะต้องรับผิดชอบในการป้อนข้อมูล การใช้ การเก็บรักษา และการบำรุงรักษาข้อมูลบัญชี และรหัสผ่านบัญชีของท่านอย่างถูกต้องและเหมาะสม โปรดใช้มาตรการรักษาความลับที่จำเป็นและมีประสิทธิภาพสำหรับข้อมูลบัญชีและรหัสผ่านบัญชีของท่าน เพื่อป้องกันความปลอดภัยของบัญชีของท่านและป้องกันการโจรกรรมบัญชีและสถานการณ์อื่น ๆ บริษัท ฯ อาจทำการตรวจสอบตัวตนเป็นครั้งคราวหรือเป็นระยะ (เช่น การยืนยันผ่าน SMS หรือการยืนยันผ่านอีเมล) สำหรับผู้ใช้บัญชีโดยใช้วิธีการอย่างน้อยหนึ่งวิธี หากการตรวจสอบล้มเหลว บริษัท ฯ มีเหตุผลตามสมควรที่จะสงสัยว่าบัญชีถูกโจรกรรมหรือมีเงื่อนไขที่ไม่ปลอดภัยอื่น ๆ และอาจตัดสินใจระงับการให้บริการต่อบัญชีและ/หรือดำเนินการตามมาตรการเพิ่มเติมตามความรุนแรงของสถานการณ์
    3.5 รับรองว่ามีการปฏิบัติตามมาตรการคว่ำบาตรและกฎหมายควบคุมการส่งออกที่บังคับใช้ท่านรับรองว่าในการใช้บริการ ของท่านจะปฏิบัติตามกฎหมายและข้อบังคับที่บังคับใช้ทั้งหมดอย่างสม่ำเสมอ รวมถึงแต่ไม่จำกัดเพียงมาตรการคว่ำบาตรที่ควบคุมโดย OFAC และมาตรการคว่ำบาตรอื่น ๆ รวมถึงระเบียบการบริหารการส่งออกของกระทรวงพาณิชย์ของสหรัฐอเมริกา

4. การคุ้มครองข้อมูลส่วนตัว
ท่านเข้าใจและยอมรับว่าบริษัท ฯ จะจัดการและคุ้มครองข้อมูลส่วนตัวของท่านตามข้อตกลงร่วมกันใน “นโยบายความเป็นส่วนตัวของบริษัท ฯ”

5. วิธีการประกาศและคำแถลงของการให้บริการ
ประกาศและคำแถลงของการให้บริการ บริษัท ฯ จะออกให้กับสมาชิกในรูปแบบใดรูปแบบหนึ่งดังต่อไปนี้ โดยท่านสมาชิกสามารถสอบถามบริการเสริมใหม่ ข้อมูลบัญชี สิทธิ์และภาระผูกพัน กฎการบริการ ฯลฯ ผ่านประกาศ และต้องปฏิบัติตามกฎการบริการที่เกี่ยวข้องอย่างเคร่งครัด:
1). ที่อยู่อีเมลที่ท่านได้ระบุไว้
2). ประกาศเว็บไซต์หลักของแอปพลิเคชัน www.wanheng789.com

6. การเปลี่ยนแปลง การระงับ หรือการยกเลิกบริการ
    6.1 บริษัท ฯ มีสิทธิ์ระงับหรือยุติบริการที่มอบให้ท่าน หากเกิดสถานการณ์ดังต่อไปนี้:
    6.1.1. ท่านมีการร้องขออย่างแข็งขัน
    6.1.2. ท่านได้กระทำหรือ บริษัท ฯ ตัดสินว่าท่านกระทำการใด ๆ ที่เป็นการละเมิดต่อกฎหมายหรือข้อบังคับของประเทศ กระทำการใด ๆ ที่เป็นการละเมิดข้อตกลงนี้หรือข้อตกลง/กฎที่เกี่ยวข้อง หรือสร้างความเสียหายต่อชื่อเสียงและผลประโยชน์ของบริษัท ฯ
    6.1.3. ตามข้อกำหนดของกฎหมาย ระเบียบ หรือหน่วยงานที่ดูแลควบคุม
    6.1.4. เพื่อความต้องการในเหตุฉุกเฉิน เช่น รักษาความปลอดภัยของบัญชีและระบบ เป็นต้น
    6.1.5. บริษัท ฯ ยุติการบริการเพื่อดำเนินการบำรุงรักษาและอัปเกรดระบบซอฟต์แวร์และฮาร์ดแวร์ของระบบบริการ
    6.1.6. การส่งข้อมูลหยุดชะงักเนื่องจากระบบขัดข้องในห้องคอมพิวเตอร์/เครือข่ายการสื่อสารของผู้ให้บริการโทรคมนาคม
    6.1.7. บริการหยุดชะงักเนื่องจากเหตุสุดวิสัย เช่น พายุไต้ฝุ่น แผ่นดินไหว ไฟดับ อุทกภัย สงคราม การโจมตีโดยผู้ก่อการร้าย ฯลฯ
    6.1.8. บริการไม่สามารถดำเนินการได้ตามปกติเนื่องจากการขัดข้องในช่องทางการชำระค่าธรรมเนียมของบุคคลที่สาม
    6.1.9. การยุติการให้บริการเนื่องจากสินค้าดิจิทัลเสมือนจริงและผู้ให้บริการเสริมหรือผู้ประกอบการระงับการดำเนินการ
    6.1.10. บริการหยุดชะงักเนื่องจากเหตุสุดวิสัยอื่น ๆ (ในมุมมองของลักษณะพิเศษของอินเทอร์เน็ต เหตุสุดวิสัยยังรวมถึงการโจมตีของแฮ็กเกอร์ ผลกระทบสำคัญที่เกิดจากการปรับเปลี่ยนทางเทคนิคในภาคโทรคมนาคม การปิดชั่วคราวเนื่องจากการควบคุมของรัฐบาล การโจมตีของไวรัส ฯลฯ ที่ส่งผลกระทบต่อการทำงานปกติของอินเทอร์เน็ต)
    6.1.11. แม้ว่าท่านได้เปิดบริการต่ออายุการใช้บริการแล้ว แต่ยังไม่ทำการชำระค่าธรรมเนียมต่ออายุได้ทันเวลา อันเนื่องมาจากเหตุผลของท่านหรือบุคคลที่สาม (รวมถึงแต่ไม่จำกัดเฉพาะการขัดข้องของระบบของบุคคลที่สาม การระงับบริการของบุคคลที่สามตามข้อตกลงของผู้ใช้ การเปลี่ยนแปลงขอบเขตบริการของบุคคลที่สามซึ่งส่งผลให้ภูมิภาคปัจจุบันไม่สามารถใช้บริการได้อีกต่อไป เป็นต้น)
    6.1.12. สถานการณ์อื่น ๆ ที่อยู่นอกเหนือการควบคุมของบริษัท ฯ

7.กฎการบริการต่ออายุอัตโนมัติ
หากท่านต้องการใช้บริการต่ออายุอัตโนมัติท่านจำเป็นต้องยอมรับกฎเหล่านี้
ท่านเข้าใจและยอมรับ:
    7.1. บริการต่ออายุอัตโนมัติของ “วันเฮง” (ต่อไปนี้จะเรียกว่า "บริการต่ออายุอัตโนมัติ") หมายถึงบริการต่ออายุภายใต้เงื่อนไขที่ท่านได้ทำการเปิดใช้งานบริการแล้ว มีความต้องการอยากต่ออายุอัตโนมัติเพื่อหลีกเลี่ยงความล้มเหลวในการต่ออายุอย่างทันท่วงที อันเนื่องมาจากความประมาทละเลยหรือเหตุผลอื่น รอบการเรียกเก็บค่าธรรมเนียมการต่ออายุอัตโนมัติที่กำหนดไว้ ประกอบด้วย รายเดือน และรายปี ฯลฯ (รายละเอียดตามที่บริษัท ฯ เสนอไว้) ซึ่งท่านสามารถเลือกได้ด้วยตัวท่านเอง
    7.2. หากท่านเปิดใช้งานบริการต่ออายุอัตโนมัติ จะถือว่าท่านอนุญาตให้บริษัท ฯ หักค่าธรรมเนียมรอบถัดไปจากบัญชีของท่าน (เช่น บัญชี Apple Store หรือ บัญชี Google Play) หรือบัญชีการชำระเงินที่เชื่อมโยงกับบัญชี Apple Store บัญชี Google Play ในเมื่อระยะเวลาการใช้บริหารใกล้จะเสร็จสิ้น
    7.3. เงื่อนไขเบื้องต้นที่ต้องปฏิบัติสำหรับข้อกำหนดของบริการต่ออายุอัตโนมัติคือ ท่านต้องผูกบริการของท่านกับบัญชีการชำระเงินของท่าน ซึ่งจะทำให้บริษัท ฯ สามารถหักค่าธรรมเนียมเต็มจำนวนจากบัญชีการชำระเงินข้างต้นได้สำเร็จ หากการต่ออายุล้มเหลวเนื่องจากยอดค่าธรรมเนียมที่หักได้ไม่เพียงพอในบัญชีการชำระเงินข้างต้น ท่านจะต้องรับผิดชอบผลที่ตามมาทั้งหมด หากท่านไม่เลือกที่จะยกเลิกบริการต่ออายุอัตโนมัติด้วยตนเอง บริษัท ฯ สามารถให้บริการต่ออายุอัตโนมัติแก่ท่านได้เมื่อ/หลังจากยอดค่าธรรมเนียมในบัญชีการชำระเงินของท่านเพียงพอ (ขึ้นอยู่กับกฎของช่องทางการชำระค่าธรรมเนียมของบุคคลที่สามแต่ละช่องทาง) และเมื่อทำการหักค่าธรรมเนียมสำเร็จ บริษัท ฯ จะกลับมาให้บริการแก่ท่านอีกครั้ง
    7.4. ท่านทราบและยอมรับว่าหากท่านใช้ช่องทางการชำระเงินของบุคคลที่สาม ท่านจะผูกพันตามข้อกำหนดในการให้บริการและกฎการใช้งานของบุคคลที่สามด้วย
    7.5. บริการต่ออายุอัตโนมัติจะมีผลตั้งแต่วันที่ท่านเปิดใช้งานจนกว่าท่านจะเลือกยกเลิกบริการต่ออายุอัตโนมัติด้วยตนเอง
    7.6. ท่านสามารถเลือกว่าจะยกเลิกบริการต่ออายุอัตโนมัติหรือไม่ หากท่านไม่ทำการยกเลิก จะถือว่าท่านยอมรับให้บริษัท ฯ พยายามต่ออายุการชำระค่าธรรมเนียมตามกฎเหล่านี้ เมื่อทำการหักจ่ายสำเร็จ บริษัท ฯ จะขยายระยะเวลาการใช้งานให้แก่ท่าน (ท่านสามารถตรวจสอบระยะเวลาใช้งานได้ในหน้า "ข้อมูลส่วนตัว - วันต่ออายุ") หากมีการปรับราคาบริการระหว่าง/ก่อนการต่ออายุอัตโนมัติ ราคาที่มีผลใช้บังคับในปัจจุบันจะมีผลเหนือกว่า
    7.7. หากท่านซื้อแพ็กเกจ อื่น ๆ ท่านต้องยกเลิกบริการต่ออายุอัตโนมัติ และใช้งานจนกว่าระยะเวลาของบริการต่ออายุอัตโนมัติเดิมสิ้นสุด ภายหลังจากระยะเวลาต่ออายุเดิมสิ้นสุดท่านจึงจะสามารถสมัครบริการแพ็กเกจอื่น ๆ ได้ 

8. กฎหมายที่บังคับใช้และขอบเขตอำนาจของกฎหมาย
ข้อตกลงและการใช้บริการ Premium อยู่ภายใต้และตีความตามกฎหมายของสิงคโปร์ ข้อพิพาทใด ๆ ที่เกิดขึ้นจากหรือเกี่ยวข้องกับข้อตกลงนี้ รวมถึงคำถามใด ๆ เกี่ยวกับการมีอยู่ ความถูกต้อง หรือการยกเลิกข้อตกลงจะถูกส่งต่อไปยังสถาบันอนุญาโตตุลาการระหว่างประเทศของสิงคโปร์ (“SIAC”) และสุดท้ายจะได้รับการแก้ไขปัญหาจากอนุญาโตตุลาการโดยตรง อนุญาโตตุลาการได้ดำเนินการโดยสถาบันอนุญาโตตุลาการระหว่างประเทศของสิงคโปร์ (“SIAC”) ตามกฎอนุญาโตตุลาการของ SIAC (“กฎ SIAC”) ที่มีผลบังคับใช้ในขณะนั้น ซึ่งถือว่ารวมอยู่ในข้อตกลงเหล่านี้โดยการอ้างอิงในข้อนี้ ซึ่งสถาบันอนุญาโตตุลาการตั้งอยู่ในประเทศสิงคโปร์ คณะอนุญาโตตุลาการประกอบด้วยอนุญาโตตุลาการหนึ่งท่าน และภาษาที่ใช้ตัดสินของอนุญาโตตุลาการต้องเป็นภาษาอังกฤษ
หากข้อกำหนดใด ๆ ของข้อตกลงนี้ถือว่าไม่ถูกต้องหรือไม่สามารถบังคับใช้ได้ สามารถตัดข้อกำหนดนั้นออกได้ และในส่วนข้อกำหนดที่เหลือยังคงมีผลบังคับใช้ตามเดิม

$nine
'''),
        ),
      ),
    );
  }
}
