import 'package:flutter/material.dart';
import 'package:wanheng_app/routes/register.dart';

import '../../utils/app_colors.dart';

class PageTermsAndCondition extends StatefulWidget {
  const PageTermsAndCondition({Key? key}) : super(key: key);

  @override
  _PageTermsAndConditionState createState() => _PageTermsAndConditionState();
}

class _PageTermsAndConditionState extends State<PageTermsAndCondition> {
  bool check = false;
  @override
  Widget build(BuildContext context) {
    double w = MediaQuery.of(context).size.width;
    double h = MediaQuery.of(context).size.height;

    return Scaffold(
      appBar: AppBar(
        backgroundColor: AppColor.mainColor,
        elevation: 0,
        title: const Text(
          'ข้อกำหนดและเงื่อนไข',
          style: TextStyle(
            fontSize: 20,
            color: Colors.white,
            fontWeight: FontWeight.bold,
          ),
        ),
        centerTitle: true,
      ),
      body: Container(
        height: h,
        child: Column(
          children: [
            Expanded(
              child: Container(
                padding: const EdgeInsets.all(8),
                color: Colors.white,
                child: SingleChildScrollView(
                  child: Text('''ข้อกำหนดและเงื่อนไขการใช้งานแอปพลิเคชัน
ข้อกำหนดและเงื่อนไขการใช้งานแอปพลิเคชันฉบับนี้ซึ่งต่อไปในข้อกำหนดนี้จะเรียกว่า "ข้อกำหนด" โดยมีรายละเอียดดังต่อไปนี้
ข้อ 1 คำนิยาม
ภายในข้อกำหนดนี้
(ก) "แอปพลิเคชัน" หมายความว่าแอปพลิเคชันชื่อว่า วันเฮง ซึ่งดำเนินการและให้บริการในลักษณะดังต่อไปนี้
แอปพลิเคชันที่ ดูดวงประจำวัน ทำนายดวง ซึ่งเป็นความเชื่อส่วนบุคคล
(ข) "เจ้าของแอปพลิเคชัน" หมายความว่า บริษัท คอมพัฒนา จำกัด เลขทะเบียน 0305564003541 สำนักงานตั้งอยู่ที่ 369/11 ซอยเดชอุดม6 ตำบลในเมือง อำเภอเมืองนครราชสีมา จ.นครราชสีมา 30000 
(ค) "ผู้ใช้งาน" หมายความว่าผู้เยี่ยมชมผู้ใช้สมาชิกของแอปพลิเคชันหรือบุคคลอื่นใดที่เข้าถึงแอปพลิเคชันไม่ว่าการเยี่ยมชมการใช้การเป็นสมาชิกหรือการเข้าถึงนั้นจะกระทำด้วยวิธีใดลักษณะใดผ่านอุปกรณ์ใดผ่านช่องทางใดและไม่ว่ามีค่าใช้จ่ายหรือไม่ก็ตาม
(ง) ข้อมูลส่วนบุคคล "หมายความว่าข้อมูลใด ๆ ก็ตามไม่ว่าของผู้ใช้งานหรือบุคคลอื่นใดที่สามารถใช้ในการระบุตัวตนของบุคคลบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม
(จ)" เนื้อหา "หมายความว่าข้อความ บทความ ความคิดเห็น บทวิเคราะห์ รูปภาพ สัญลักษณ์ เครื่องหมาย รูปภาพประดิษฐ์ภาพถ่าย ภาพเคลื่อนไหว ภาพยนตร์ เสียง สิ่งบันทึกเสียง การออกแบบ คำสั่ง ชุดคำสั่ง หรือการสื่อสาร ไม่ว่าในลักษณะใดและวิธีใด ๆ ในแอปพลิเคชัน และไม่ว่าเนื้อหานั้นจะมีการจำกัดการเข้าถึงหรือไม่ก็ตาม

ข้อ 2 การอนุญาตให้ใช้งานแอปพลิเคชัน
โดยที่เจ้าของแอปพลิเคชันได้เปิดให้ใช้งานซึ่งแอปพลิเคชัน ตามข้อกำหนดฉบับนี้ และผู้ใช้งานมีความประสงค์จะใช้งาน แอปพลิเคชันดังกล่าว โดยในการใช้งานแอปพลิเคชัน ผู้ใช้งานได้อ่านและเข้าใจข้อความและเงื่อนไขต่าง ๆ แห่งข้อกำหนดฉบับนี้ โดยละเอียดตลอดดีแล้วและตกลงตามเงื่อนไขที่กำหนดไว้ในข้อกำหนดฉบับนี้แล้วทั้งสิ้น ในการนี้เจ้าของแอปพลิเคชันจึงอนุญาตให้ผู้ใช้งาน ใช้งานแอปพลิเคชัน ภายใต้เงื่อนไขแห่งข้อกำหนดนี้

ข้อ 3 ข้อห้ามการใช้งานแอปพลิเคชัน
ไม่ว่าในกรณีใด ๆ ในการใช้งานแอปพลิเคชันของ ผู้ใช้งานผู้ใช้งานตกลงจะไม่ใช้งานแอปพลิเคชัน ไม่ว่าโดยตรง หรือโดยอ้อมไปในลักษณะใด ลักษณะหนึ่ง ดังต่อไปนี้
(ก) กระทำการใด ๆ ที่ขัดต่อกฎหมายคำพิพากษาศาลหรือคำสั่งของรัฐบาลหรือหน่วยงานที่ใช้อำนาจรัฐ
(ข) กระทำการใด ๆ ที่อาจขัดต่อความสงบเรียบร้อยหรือจารีตประเพณี
(ค) กระทำการใด ๆ อันเป็นการละเมิดทรัพย์สินทางปัญญา ลิขสิทธิ์ เครื่องหมายการค้า สิทธิบัตร สิทธิในชื่อเสียงสิทธิ ส่วนบุคคล และสิทธิ์อื่นใดของเจ้าของแอปพลิเคชัน หรือบุคคลอื่น
(ง) กระทำการใด ๆ ที่นำไปสู่การเก็บรวบรวมการเปิดเผยหรือการให้ซึ่งข้อมูลส่วนบุคคลโดยไม่ชอบด้วยกฎหมาย
(จ) กระทำการใด ๆ ที่รบกวนการทำงานของระบบแม่ข่ายชุดคำสั่งหรือระบบเครือข่ายของแอปพลิเคชัน

ข้อ 4 บัญชีผู้ใช้
ในการใช้งานแอปพลิเคชันเจ้าของแอปพลิเคชันอาจจัดให้มีบัญชีผู้ใช้ของแต่ละผู้ใช้ตามที่ผู้ใช้งานร้องขอในแต่ละคราว โดยที่เจ้าของแอปพลิเคชันมีสิทธิ์แต่เพียงผู้เดียวในการ อนุมัติเปิดบัญชีผู้ใช้ กำหนดประเภทบัญชีผู้ใช้ กำหนดสิทธิ์การเข้าถึงข้อมูลของแต่ละประเภทบัญชีผู้ใช้ ค่าใช้จ่ายใด ๆ เกี่ยวกับบัญชีผู้ใช้หน้าที่ความรับผิดชอบของผู้ใช้งานซึ่งเป็นเจ้าของบัญชีผู้ใช้นั้น ๆ
ทั้งนี้ผู้ใช้งานตกลงจะเก็บรักษาชื่อบัญชีผู้ใช้รหัสผ่านและข้อมูลใด ๆ ของตนไว้เป็นความลับอย่างเคร่งครัด และตกลงจะไม่ยินยอมให้รวมถึงใช้ความพยายามอย่างที่สุดในการป้องกันไม่ให้บุคคลอื่นใช้งานบัญชีผู้ใช้ของผู้ใช้งาน
ในกรณีที่มีการใช้บัญชีผู้ใช้ของผู้ใช้งานโดยบุคคลอื่นผู้ใช้งานตกลง และรับรองว่าการใช้งานโดยบุคคลอื่นดังกล่าวได้กระทำในฐานะตัวแทนของผู้ใช้งานและมีผลผูกพันเสมือนหนึ่งผู้ใช้งานเป็นผู้กระทำการเองทั้งสิ้น

ข้อ 5 การเก็บและใช้ข้อมูลส่วนบุคคลของผู้ใช้งาน
ในการใช้งานแอปพลิเคชันผู้ใช้งานรับทราบและตกลงให้เจ้าของแอปพลิเคชันมีสิทธิ์จัดเก็บประมวลผลนำไปใช้ประโยชน์ซึ่งข้อมูลส่วนบุคคลของผู้ใช้งานที่ผู้ใช้งานให้ไว้แก่เจ้าของแอปพลิเคชันอันได้แก่ข้อมูลส่วนบุคคลดังต่อไปนี้
ข้อมูลส่วนบุคคล เช่น ชื่อ นามสกุล อายุ วันเดือนปีเกิด สัญชาติ เลขประจำตัวประชาชน หนังสือเดินทาง เป็นต้น
ข้อมูลการติดต่อ เช่น ที่อยู่ หมายเลขโทรศัพท์ อีเมล เป็นต้น
ข้อมูลบัญชี เช่น บัญชีผู้ใช้งาน ประวัติการใช้งาน เป็นต้น
หลักฐานแสดงตัวตน เช่น สำเนาบัตรประจำตัวประชาชน สำเนาหนังสือเดินทาง เป็นต้น
ข้อมูลการทำธุรกรรมและการเงิน เช่น ประวัติการสั่งซื้อ รายละเอียดบัตรเครดิต บัญชีธนาคาร เป็นต้น
ข้อมูลทางเทคนิค เช่น IP address, Cookie ID, ประวัติการใช้งานเว็บไซต์ (Activity Log) เป็นต้น
ข้อมูลอื่น ๆ เช่น รูปภาพ ภาพเคลื่อนไหว และข้อมูลอื่นใดที่ถือว่าเป็นข้อมูลส่วนบุคคลตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล

-เพื่อพิจารณาให้ความช่วยเหลือ-เพื่อเก็บรวบรวมข้อมูลสถิติ
-เพื่อนำข้อมูลมาวิเคราะห์
-อื่น ๆ ที่เกี่ยวข้อง

โดยที่ผู้ใช้งานมีสิทธิเข้าถึงลบแก้ไขเปลี่ยนแปลง โอนย้าย ปฏิเสธ ข้อมูลส่วนบุคคลที่ให้ไว้แก่เจ้าของแอปพลิเคชันได้ และไม่ว่าเวลาใดผู้ใช้งานอาจถอนความยินยอมการเก็บ และใช้ข้อมูลส่วนบุคคลของผู้ใช้งานดังกล่าวได้ตราบเท่าที่ไม่ขัดต่อกฎหมายหรือสิทธิของเจ้าของแอปพลิเคชัน
ในกรณีที่เจ้าของแอปพลิเคชันนำข้อมูลส่วนบุคคลของผู้ใช้งานออกใช้ประโยชน์ เจ้าของแอปพลิเคชันตกลงจะใช้ข้อมูลดังกล่าวตราบเท่าที่ไม่ก่อให้เกิดความเสียหายความเดือดร้อน และความรำคาญแก่เจ้าของข้อมูล และจะไม่เปิดเผยข้อมูลดังกล่าวต่อบุคคลภายนอกในลักษณะที่อาจระบุตัวตนของผู้ใช้งานเจ้าของข้อมูลใด เว้นแต่ เป็นการใช้และเปิดเผยตามที่กฎหมายกำหนดหรือโดยคำสั่งของหน่วยงานที่บังคับใช้อำนาจของรัฐ

ข้อ 6 คำรับรองและหน้าที่ของผู้ใช้งาน
ในการใช้งานแอปพลิเคชันของผู้ใช้งานผู้ใช้งานมีหน้าที่และให้คำรับรองต่อเจ้าของแอปพลิเคชันว่าจะใช้ความพยายามอย่างที่สุดเพื่อปฏิบัติตามหน้าที่ของผู้ใช้งานและตลอดจนเงื่อนไขของข้อกำหนดนี้ดังต่อไปนี้

(ก) ผู้ใช้งานได้อ่านและเข้าใจข้อความ และเงื่อนไขต่าง ๆ แห่งข้อกำหนดฉบับนี้โดยละเอียดตลอดดีแล้วและโดยในการเข้าเยี่ยมชมใช้งาน หรือการเป็นสมาชิกของแอปพลิเคชัน ผู้ใช้งานตกลงตามเงื่อนไขที่กำหนดไว้ในข้อกำหนดฉบับนี้แล้วทั้งสิ้น
(ข) ผู้ใช้งานเข้าใจและรับทราบดีว่าข้อกำหนดฉบับนี้ เป็นสัญญาฉบับหนึ่งซึ่งมีผลผูกพันและสามารถคับใช้ได้ตามกฎหมายระหว่างเจ้าของแอปพลิเคชัน และผู้ใช้งาน
(ค) ผู้ใช้งานจะดำเนินการใด ๆ อันจำเป็นและสมควรให้พนักงานของผู้ใช้งานผู้รับจ้างช่วงผู้ช่วยที่ปรึกษาหรือตัวแทนใด ๆ ของผู้ใช้งาน (ถ้ามี) ปฏิบัติตามข้อกำหนดฉบับนี้โดยเคร่งครัดด้วย
(ง) ในกรณีที่มีบุคคลอื่นใช้สิทธิเรียกร้องหรือมีข้อเรียกร้องต่อผู้ใช้งาน หรือผู้ใช้งานถูกฟ้องร้องดำเนินคดีเกี่ยวกับหรือมีสาเหตุมาจากการใช้งานแอปพลิเคชัน ผู้ใช้งานจะยุติข้อเรียกร้องด้วยค่าใช้จ่ายและความรับผิดชอบของผู้ใช้งานเองและผู้ใช้งานตกลงปกป้องด้วยความพยายามอย่างที่สุด ไม่ให้เจ้าของแอปพลิเคชันเข้าไปเกี่ยวข้องในกระบวนการยุติข้อเรียกร้องดังกล่าว
(จ) ในกรณีที่เจ้าของแอปพลิเคชันมีค่าเสียหายหรือค่าใช้จ่ายเกี่ยวกับหรือมีสาเหตุมาจากการใช้งานแอปพลิเคชันของผู้ใช้งานผู้ใช้งานตกลงจะชดใช้ค่าเสียหายหรือค่าใช้จ่ายดังกล่าวให้แก่เจ้าของแอปพลิเคชันโดยสิ้นเชิง

ข้อ 7 เนื้อหาของผู้ใช้งาน
ในการใช้งานแอปพลิเคชันผู้ใช้งานอาจสามารถแสดงเนื้อหาของผู้ใช้งานภายในแอปพลิเคชันได้ไม่ว่ามีการจํากัดสิทธิการเข้าถึงเนื้อหาหรือไม่ก็ตามโดยผู้ใช้งานตกลงจะ
(ก) ไม่แสดงเนื้อหาที่เป็นการละเมิดสิทธิของบุคคลอื่นซึ่งรวมถึงแต่ไม่จำกัดเฉพาะลิขสิทธิ์ธรรมสิทธิ์สิทธิบัตรสิทธิในเครื่องหมายการค้า, สิทธิ์ในแบบผลิตภัณฑ์สิทธิในผลิตภัณฑ์อรรถประโยชน์ความลับทางการค้าสิทธิในเกียรติยศชื่อเสียงสิทธิในภาพบุคคลสิทธิส่วนบุคคลและสิทธิ์ในชื่อเสียง
(ข) ไม่แสดงเนื้อหาไม่ขัดต่อความสงบเรียบร้อยและศีลธรรมอันดีของประชาชนการสนับสนุนความรุนแรงและการกระทำผิดกฎหมาย
(ค) ไม่แสดงเนื้อหาใด ๆ ที่น่าสงสัยหยาบคายหลอกลวงล่อลวงหรือชี้แนะในลักษณะที่อาจเป็นเป็นอันตรายต่อผู้ใช้งานรายอื่นหรือให้เกิดการกระทำผิดกฎหมาย
(ง) ไม่แสดงข้อมูลส่วนตัวหรือเป็นความลับที่เป็นของผู้อื่นโดยไม่ได้รับอนุญาต
(จ) ไม่แสดงเนื้อหาที่เป็นเท็จไม่ว่าการแสดงเนื้อหาอันเป็นเท็จนั้นจะก่อให้เกิดความเสียหายต่อผู้อื่นหรือไม่ก็ตาม
(ฉ) ไม่แสดงเนื้อหาที่นำไปสู่การเลือกปฏิบัติทางเชื้อชาติชาติกำเนิดสัญชาติศาสนาเพศสถานภาพทางสังคม ฯลฯ

ข้อ 8 การปฏิบัติผิดข้อกำหนดของผู้ใช้งานในกรณีดังต่อไปนี้
(ก) ผู้ใช้งานฝ่าฝืนข้อกำหนดฉบับนี้คำรับรองของผู้ใช้งานที่ให้ไว้ในข้อกำหนดฉบับนี้หรือแนวทางปฏิบัติใด ๆ ที่เจ้าของแอปพลิเคชันได้แจ้งให้ผู้ใช้งานทราบไม่ว่าโดยทั่วไปหรือโดยเฉพาะเจาะจง
(ข) ผู้ใช้งานใช้งานแอปพลิเคชันไปในวัตถุประสงค์ที่ผิดกฎหมายขัดต่อความสงบเรียบร้อยของสังคม
(ค) ผู้ใช้งานกระทำการใด ๆ ที่อาจก่อให้เกิดความเสียหายแก่แอปพลิเคชันเจ้าของแอปพลิเคชันผู้ใช้งานรายอื่น ๆ หรือบุคคลภายนอก
(ง) ผู้ใช้งานกระทำการใด ๆ ที่เจ้าของแอปพลิเคชันพิจารณาเห็นว่าไม่เหมาะสม
เจ้าของแอปพลิเคชันโดยดุลพินิจของเจ้าของแอปพลิเคชันแต่เพียงผู้เดียวอาจดำเนินการดังต่อไปนี้
(ก) ส่งหนังสือเตือนอย่างเป็นทางการให้แก่ผู้ใช้งานแก้ไขการกระทำพฤติกรรมดังกล่าว
(ข) ระงับการใช้แอปพลิเคชันของผู้ใช้งานภายในระยะเวลาใดระยะเวลาหนึ่ง โดยจะมีกำหนดระยะเวลาหรือไม่ก็ได้โดยไม่ต้องแจ้งให้ทราบล่วงหน้าและ
(ค) ยกเลิกสิทธิ์การใช้หรือการเข้าถึงแอปพลิเคชันของผู้ใช้งานโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
ในกรณีที่เจ้าของแอปพลิเคชันระงับการใช้งานหรือยกเลิกสิทธิ์การใช้หรือการเข้าถึงแอปพลิเคชันตามข้อกาหนดนี้ผู้ใช้งานรับทราบ และตกลงว่าเจ้าของแอปพลิเคชันไม่มีความรับผิดสำหรับความสูญเสียความเสียหาย ข้อเรียกร้องความรับผิดค่าใช้จ่ายใด ๆ ที่เกิดจากหรือเกี่ยวข้องกับการดำเนินการดังกล่าวตามข้อกำหนดฉบับนี้

ข้อ 9 ความพร้อมใช้งานของแอปพลิเคชัน
ผู้ใช้งานตกลงและทราบดีว่าเจ้าของแอปพลิเคชั้นอาจระงับการใช้งานแอปพลิเคชัน ไม่ว่าทั้งหมดหรือแต่บางส่วนไม่ว่าเป็นการชั่วคราวหรือถาวร โดยไม่มีหน้าที่ต้องชดเชยความเสียหายใด ๆ ที่อาจเกิดขึ้นแก่ผู้ใช้งานในกรณีดังต่อไปนี้
(ก) การบำรุงรักษาเครื่องมือและอุปกรณ์ที่จำเป็นในการเปิดให้ใช้งานแอปพลิเคชันอันรวมถึงแต่ไม่จำกัดเพียงการบำรุงรักษาระบบแม่ข่าย (Server Maintenance)
(ข) การปรับปรุงและพัฒนาระบบชุดคำสั่งที่เกี่ยวข้องกับการเปิดให้ใช้งานแอปพลิเคชันอันรวมถึงแต่ไม่จำกัดเพียงการปรับปรุงชุดค่าสังของแอปพลิเคชัน (Update) การปรับปรุงชุดคำสั่งของระบบ (Firmware Update)
(ค) เครื่องมืออุปกรณ์หรือระบบชุดคาสั่งที่เกี่ยวข้องกับการเปิดให้ใช้งานแอปพลิเคชันไม่สามารถใช้งานได้อันเนื่องมาจากเครื่องมืออุปกรณ์หรือระบบชุดคำสั่งนั้นไม่ว่าเครื่องมืออุปกรณ์หรือระบบชุดค่าสั่งนั้นจะอยู่ในความครอบครองของเจ้าของแอปพลิเคชันหรือบุคคลภายนอกก็ตาม
(ง) เหตุสุดวิสัยอันรวมถึงแต่ไม่จํากัดเพียงระบบไฟฟ้าขัดข้องระบบติดต่อสื่อสารขัดข้องอุบัติเหตุอุบัติภัยเพลิงใหม่ภัยธรรมชาติการนัดหยุดงานการบังคับใช้หรือเปลี่ยนแปลงกฎหมายคำสั่งของรัฐบาล

ข้อ 10 การยกเว้นความรับผิด
ผู้ใช้งานตกลงและทราบดีว่า ไม่มีส่วนหนึ่งส่วนใดในข้อกำหนดนี้หรือภายในแอปพลิเคชัน ไม่ว่าโดยชัดแจ้งหรือโดยปริยายที่เจ้าของแอปพลิเคชัน
(ก) รับประกันความเสถียรความเชื่อถือได้ความแม่นยำ ความสมบูรณ์ ประสิทธิผล ความเหมาะสมกับวัตถุประสงค์ โดยเฉพาะเจาะจงของผู้ใช้งานความปลอดภัย ข้อผิดพลาดของแอปพลิเคชัน
(ข) รับผิดชอบค่าเสียหายใด ๆ ที่เกิดขึ้นกับผู้ใช้งานในการใช้แอปพลิเคชัน อันรวมถึงแต่ไม่จำกัดเพียงความเสียหายต่ออุปกรณ์ ระบบ ที่ผู้ใช้งานใช้ในการใช้งานแอปพลิเคชันหรือการสูญหายของข้อมูลหรือเนื้อหาของผู้ใช้งานสิทธิ์และชื่อเสียงของผู้ใช้งาน ยกเว้น ความเสียหายดังกล่าวเกิดจากการกระทำโดยเจตนาหรือการประมาทเล็นเล่ออย่างร้ายแรงของเจ้าของแอปพลิเคชัน
(ค) รับผิดชอบค่าเสียหายใด ๆ ที่เกิดขึ้นจากการกระทำของผู้ใช้งานเอง ไม่ว่าผู้ใช้งานจะเจตนาหรือไม่ก็ตาม
(ง) รับผิดชอบค่าเสียหายใด ๆ ที่เกิดขึ้นจากการกระทำของบุคคลภายนอก อันรวมถึงแต่ไม่จำกัดเพียง การกระทำของผู้ไม่ได้รับอนุญาตให้เข้าถึงข้อมูล (Hacker) อาชญากรคอมพิวเตอร์

ข้อ 11 ทรัพย์สินทางปัญญา
ผู้ใช้งานเข้าใจและรับทราบดีว่าสิทธิ์ในทรัพย์สินทางปัญญาทั้งปวงอันรวมถึงแต่ไม่จำกัดเพียงเนื้อหาของเจ้าของแอปพลิเคชันลิขสิทธิ์สิทธิบัตร เครื่องหมายการค้า เครื่องหมายบริการ ชื่อทางการค้า หรือการออกแบบระบบงานใดที่ปรากฏในแอปพลิเคชันและที่ใช้งานบนแอปพลิเคชัน ไม่ว่าระยะเวลาใด เป็นสิทธิเด็ดขาดของเจ้าของแอปพลิเคชันทั้งสิ้น
ผู้ใช้งานมีสิทธิ์ใช้ซึ่งทรัพย์สินทางปัญญาอย่างเพิกถอนได้ และอย่างไม่สามารถโอนแก่กันได้ตราบเท่าที่เจ้าของแอปพลิเคชันอนุญาตให้ใช้ ภายใต้เงื่อนไขแห่งข้อกำหนดนี้เท่านั้น และไม่ว่า ณ เวลาใด ๆ ไม่มีข้อตกลงใดในข้อกำหนดนี้ไม่ว่าโดยชัดแจ้งหรือปริยายที่เป็นการโอนสิทธิ์ใด ๆ อันเกี่ยวกับทรัพย์สินทางปัญญาดังกล่าวให้แก่ผู้ใช้งานทั้งทางตรงและทางอ้อม

ข้อ 12 การเก็บรักษาความลับ
ในการใช้งานแอปพลิเคชัน ผู้ใช้งานอาจได้ล่วงรู้หรือได้รับข้อมูลจากเจ้าของแอปพลิเคชันหรือจากบุคคลอื่นใดเพื่อการใช้งานแอปพลิเคชันตามข้อกำหนดนี้ ซึ่งยังไม่ได้มีการเปิดเผยอย่างสาธารณะหรือไม่มีเจตนาให้ถูกเปิดเผยอย่างทั่วไป ณ ขณะที่เปิดเผยข้อมูลผู้ใช้งานตกลงจะรักษาข้อมูลของเจ้าของแอปพลิเคชัน หรือข้อมูลที่ได้รับจากเจ้าของแอปพลิเคชันไว้เป็นความลับ ไม่ว่าจะเป็นข้อมูลส่วนบุคคลหรือข้อมูลทางการค้า และไม่ว่าจะมีมูลค่าหรือไม่ก็ตาม และจะไม่เปิดเผย ตีพิมพ์ ประกาศ หรือเผยแพร่ต่อบุคคลที่สาม เว้นแต่จะเป็นการกระทำตามกฎหมาย คำสั่งของหน่วยงานที่บังคับใช้อำนาจของรัฐหรือได้รับความยินยอมเป็นลายลักษณ์อักษรจากเจ้าของแอปพลิเคชันก่อนล่วงหน้า

ข้อ 13 การแก้ไขเปลี่ยนแปลง
เจ้าของแอปพลิเคชั้นอาจแก้ไขและเปลี่ยนแปลงข้อความในข้อกาหนดนี้ได้ไม่ว่าเวลาใดก็ตามและไม่ว่าทั้งหมดหรือบางส่วนโดยเจ้าของแอปพลิเคชันจะแจ้งให้ผู้ใช้งานทราบเมื่อมีการเปลี่ยนแปลงในแต่ละคราวและให้ถือว่าข้อตกลงที่แก้ไขเพิ่มเต็มดังกล่าวเป็นส่วนหนึ่งของข้อกำหนดนี้ด้วย

ข้อ 14 ความสัมพันธ์ของคู่สัญญา
โดยที่คู่สัญญาทั้งสองฝ่ายเข้าใจและทราบดีว่าการเข้าทำข้อกำหนดฉบับนี้ไม่ทำให้คู่สัญญาและพนักงานของคู่สัญญาแต่ละฝ่ายมีความสัมพันธ์ในฐานะเป็นลูกจ้างตามกฎหมายแรงงานหรือเป็นหุ้นส่วนกันตามกฎหมายหุ้นส่วนและบริษัทแต่อย่างใด

ข้อ 15 การโอนสิทธิ
เว้นแต่จะได้กำหนดไว้เป็นอย่างอื่นในข้อกำหนดนี้ผู้ใช้งานตกลงจะไม่โอนสิทธิ์หน้าที่และ / หรือความรับผิดตามข้อกำหนดนี้ให้แก่บุคคลใดโดยมิได้รับความยินยอมเป็นลายลักษณ์อักษรจากเจ้าของแอปพลิเคชันเป็นการล่วงหน้า

ข้อ 16 การสละสิทธิ์
การที่เจ้าของแอปพลิเคชันไม่ใช้สิทธิ หรือใช้สิทธิ์ล่าช้า ในเรื่องหนึ่งเรื่องใดหรือคราวหนึ่งคราวใดก็ดีมีให้ถือว่าเจ้าของ แอปพลิเคชันสละสิทธิ์ในเรื่องดังกล่าว และการที่เจ้าของแอปพลิเคชันใช้สิทธิ์แต่เพียงบางส่วนหรือสละสิทธิ์ในเรื่องหนึ่งเรื่องใดหรือคราวหนึ่งคราวใด ก็มิให้ถือว่าเป็นการสละสิทธิ์ในเรื่องอื่นหรือในคราวอื่นด้วย

ข้อ 17 การรายงานปัญหาและพฤติกรรม
ผู้ใช้งานอาจรายงานปัญญาใด ๆ จากการใช้งานแอปพลิเคชันอันรวมถึงแต่ไม่จำกัดเพียงข้อผิดพลาดของแอปพลิเคชัน หรือของชุดคำสั่งพฤติกรรมการใช้งานของผู้ใช้งานรายอื่น ที่ไม่เป็นไปตามข้อกำหนดนี้ หรือการใช้งานในลักษณะที่อาจก่อให้เกิดความไม่สงบเรียบร้อยขัดต่อศีลธรรมอันดีของประชาชนการสนับสนุนการใช้ความรุนแรงหรือพฤติกรรมการใช้งานในลักษณะที่ก่อกวนผู้ใช้งานรายอื่นได้ที่ contact@compattana.com

ข้อ 18 การช่วยเหลือ
ในกรณีที่ผู้ใช้งานมีข้อสงสัยข้อสอบถาม เกี่ยวการใช้งานแอปพลิเคชัน ผู้ใช้งานสามารถ ศึกษาข้อมูลเพิ่มเติมด้วยตัวผู้ใช้งานเองได้ที่ www.infuse.co.th สอบถามได้ที่ contact@compattana.com

ข้อ 19 การบอกกล่าว
ผู้ใช้งานตกลงให้คำบอกกล่าวหรือหนังสือซึ่งเจ้าของแอปพลิเคชันต้องแจ้งให้แก่ตน ภายใต้ข้อกำหนดนี้จะถือว่าได้มีการแจ้งแก่กันแล้ว

ข้อ 20 กฎหมายที่ใช้บังคับ
ข้อกำหนดฉบับนี้ให้อยู่ภายใต้บังคับกฎหมายของประเทศไทย

ข้อ 21 การระงับข้อพิพาท
หากมีข้อโต้เถียงข้อขัดแย้งใด ๆ เกิดขึ้นอันเนื่องมาจากข้อกำหนดฉบับนี้ หากคู่สัญญาไม่สามารถตกลงกันได้คู่สัญญาตกลงจะนำข้อพิพาทดังกล่าวขึ้นฟ้องต่อศาลในประเทศไทย
                '''),
                ),
              ),
            ),
            Container(
              padding: const EdgeInsets.all(8),
              width: w,
              color: Colors.grey.shade300,
              child: Column(
                mainAxisAlignment: MainAxisAlignment.spaceBetween,
                children: [
                  Row(
                    children: [
                      Checkbox(
                        activeColor: Colors.black,
                        checkColor: Colors.white,
                        value: check,
                        onChanged: (val) {
                          setState(() {
                            check = val!;
                          });
                        },
                      ),
                      Text(
                        'ข้าพเจ้าตกลงและยอมรับข้อกำหนดและเงื่อนไข',
                        style: TextStyle(fontWeight: FontWeight.bold),
                      ),
                    ],
                  ),
                  Row(
                    mainAxisAlignment: MainAxisAlignment.spaceBetween,
                    children: [
                      TextButton(
                        onPressed: () {
                          Navigator.pop(context);
                        },
                        child: Text(
                          'ไม่ยอมรับ',
                          style: TextStyle(fontWeight: FontWeight.bold, color: Colors.red),
                        ),
                      ),
                      TextButton(
                        onPressed: check == true
                            ? () {
                                Navigator.push(context, pageRegisterEmail());
                              }
                            : null,
                        child: Text(
                          'ยอมรับ',
                          style: TextStyle(fontWeight: FontWeight.bold),
                        ),
                      ),
                    ],
                  ),
                ],
              ),
            )
          ],
        ),
      ),
    );
  }
}
